Autodesk.Revit.DB.Architecture.RailTypeDefaultJoinOption
The default join type of the rail.
Since:
2013

Autodesk.Revit.DB.Architecture.RailTypeDefaultJoinOption.Fillet
The rails will be joined by a fillet connection.

Autodesk.Revit.DB.Architecture.RailTypeDefaultJoinOption.Miter
The rails will be joined by a miter connection.